#############################################################################################################################
# Този изходен код и файл са част от демонстрационните примерни към изследването:
# Бъдещето е неясно….и това е добре, Университетско издателство „Паисий Хилендарски", Пловдив, 2023, ISBN: 978-619-202-850-3
#
#
# Част от проект КП-06-ДК2/6, финансиран от Фонд Научни Изследвания (ФНИ).
#############################################################################################################################

import requests
import pandas as pd

series_key2 = 'EXR/D.CHF.EUR.SP00.A'

url = 'https://sdw-wsrest.ecb.europa.eu/service/data/'
# headers used as content negotiation to return data in json format
headers = {'Accept':'application/json'}
r = requests.get(f'{url}{series_key2}', headers=headers).json()

print(r['dataSets'][0])