#############################################################################################################################
# Този изходен код и файл са част от демонстрационните примерни към изследването:
# Бъдещето е неясно….и това е добре, Университетско издателство „Паисий Хилендарски", Пловдив, 2023, ISBN: 978-619-202-850-3
#
#
# Част от проект КП-06-ДК2/6, финансиран от Фонд Научни Изследвания (ФНИ).
#############################################################################################################################

library(quantmod)

getSymbols("^GSPC")
getSymbols("^GDAXI")

plot(GSPC$GSPC.Adjusted)
plot(ROC(GSPC$GSPC.Adjusted))
plot(GDAXI$GDAXI.Adjusted)
plot(ROC(GDAXI$GDAXI.Adjusted))
